---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingType.RemoveWireSize(Autodesk.Revit.DB.Electrical.WireSize)
source: html/a6195154-d5f0-46f3-3bb4-f5325de5da17.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingType.RemoveWireSize Method

Remove an existing wire size type from this temperature rating type.

## Syntax (C#)
```csharp
public void RemoveWireSize(
	WireSize wireSize
)
```

## Parameters
- **wireSize** (`Autodesk.Revit.DB.Electrical.WireSize`) - The wire size type to be removed.